---
kind: method
id: M:Autodesk.Revit.DB.DividedPath.IsValidEndIndent(System.Double)
source: html/891b6c7f-ba0a-1e91-7eda-3672a7c3dcbe.htm
---
# Autodesk.Revit.DB.DividedPath.IsValidEndIndent Method

Checks that the indent value does not cause the beginningIndent and endIndent to overlop

## Syntax (C#)
```csharp
public bool IsValidEndIndent(
	double endIndent
)
```

## Parameters
- **endIndent** (`System.Double`)